## How do I remove columns from a pandas DataFrame?
https://courses.dataschool.io/view/courses/pandas-in-30-days/2341096-course-videos/7471434-day-6-how-do-i-remove-columns-from-a-pandas-dataframe

In [1]:
import pandas as pd

In [20]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [21]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [22]:
ufo.shape

(18241, 5)

In [23]:
ufo.drop('Colors Reported', axis=1, inplace=True)

In [24]:
ufo.columns

Index(['City', 'Shape Reported', 'State', 'Time'], dtype='object')

In [25]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [26]:
ufo.drop(['City', 'State'], axis=1, inplace=True)

In [27]:
ufo.columns

Index(['Shape Reported', 'Time'], dtype='object')

In [28]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [29]:
list(range(2))

[0, 1]

In [30]:
ufo.drop(list(range(2)), axis=0, inplace=True)

In [31]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00